dataset_gen/OpenFoam/design_points/design_point_1/0/Ccx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
9600
(
-3.07527
-2.82821
-2.58113
-2.33404
-2.08696
-1.83987
-1.59276
-1.34566
...
)
;

boundaryField
{
    FrontBack
    {
        type            empty;
    }
    Cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
1.39698
1.41139
1.42632
1.44174
1.45762
1.47394
1.49068
1.50781
...
)
;
    }
    Bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
-3.13154
-2.88154
-2.63154
-2.38154
-2.13154
-1.88154
-1.63154
-1.38154
...
)
;
    }
    Top
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
6.61846
6.36846
6.11846
5.86846
5.61846
5.36846
5.11846
4.86846
...
)
;
    }
    Inlet
    {
        type            calculated;
        value           uniform -15;
    }
    Outlet
    {
        type            calculated;
        value           uniform 15;
    }
}


// ************************************************************************* //
